app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "email"]]
SELECT  "users".* FROM "users" WHERE "users"."referral_code" = ? LIMIT 1  [["referral_code", "e2da635528"]]
INSERT INTO "users" ("email", "referrer_id", "created_at", "updated_at", "referral_code") VALUES (?, ?, ?, ?, ?)  [["email", "rogerximenez+1@gmail.com"], ["referrer_id", 1], ["created_at", "2015-03-28 21:36:57.023717"], ["updated_at", "2015-03-28 21:36:57.023717"], ["referral_code", "e027213e5b"]]
---
	def create
		#find a User with the same email
		@user = User.find_by_email(:email)

		#if User does not exist
		if @user.nil?
			#create a new instance of User with email
			@user = User.new(user_params)

			#get the User with the same referral code as in the cookies hash
			@referred_by = User.find_by_referral_code(cookies[:h_ref])

			#if User found, set current User's referrer
			if !@referred_by.nil?
				@user.referrer = @referred_by
			end

			#save instance of current user
			@user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "test@testme.com"]]
---
	def refer
		#retreive the current User's email from the cookies hash
		email = cookies[:h_email]

		#retreive current User
		@user = User.find_by_email(email)

SELECT "users".* FROM "users"
---
	def admin
		  #allow admin acess to all users
      @users = User.all